OpenNuvoton/M251BSP/Library/StdDriver/src/rtc.c
/****************************************************************************
 * @file     rtc.c
 * @version  V1.00
 * @brief    M251 series CLK driver source file
 *
 * SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2019 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/
#include "NuMicro.h"


/** @cond HIDDEN_SYMBOLS */

/*---------------------------------------------------------------------------------------------------------*/
/* Macro, type and constant definitions                                                                    */
/*---------------------------------------------------------------------------------------------------------*/
#define RTC_GLOBALS

/*---------------------------------------------------------------------------------------------------------*/
/* Global file scope (static) variables                                                                    */
/*---------------------------------------------------------------------------------------------------------*/
static volatile uint32_t g_u32HiYear;
static volatile uint32_t g_u32LoYear;
static volatile uint32_t g_u32HiMonth;
static volatile uint32_t g_u32LoMonth;
static volatile uint32_t g_u32HiDay;
static volatile uint32_t g_u32LoDay;
static volatile uint32_t g_u32HiHour;
static volatile uint32_t g_u32LoHour;
static volatile uint32_t g_u32HiMin;
static volatile uint32_t g_u32LoMin;
static volatile uint32_t g_u32HiSec;
static volatile uint32_t g_u32LoSec;

/** @endcond HIDDEN_SYMBOLS */




/** @addtogroup Standard_Driver Standard Driver
  @{
*/

/** @addtogroup RTC_Driver RTC Driver
  @{
*/

/** @addtogroup RTC_EXPORTED_FUNCTIONS RTC Exported Functions
  @{
*/

/**
  * @brief      Initialize RTC module and start counting
  *
  * @param[in]  psPt    Specify the time property and current date and time. It includes:           \n
  *                     u32Year: Year value, range between 2000 ~ 2099.                             \n
  *                     u32Month: Month value, range between 1 ~ 12.                                \n
  *                     u32Day: Day value, range between 1 ~ 31.                                    \n
  *                     u32DayOfWeek: Day of the week. [RTC_SUNDAY / RTC_MONDAY / RTC_TUESDAY /
  *                                                     RTC_WEDNESDAY / RTC_THURSDAY / RTC_FRIDAY /
  *                                                     RTC_SATURDAY]                               \n
  *                     u32Hour: Hour value, range between 0 ~ 23.                                  \n
  *                     u32Minute: Minute value, range between 0 ~ 59.                              \n
  *                     u32Second: Second value, range between 0 ~ 59.                              \n
  *                     u32TimeScale: [RTC_CLOCK_12 / RTC_CLOCK_24]                                 \n
  *                     u8AmPm: [RTC_AM / RTC_PM]                                                   \n
  *
  * @return     0: SUCCESS
  * @return     -1: Initialize RTC module fail
  *
  * @details    This function is used to: \n
  *                 1. Write initial key to let RTC start count.  \n
  *                 2. Input parameter indicates start date/time. \n
  *                 3. User has to make sure that parameters of RTC date/time are reasonable. \n
  * @note       Null pointer for using default starting date/time.
  */
int32_t RTC_Open(S_RTC_TIME_DATA_T *psPt)
{
    uint32_t u32TimeOutCount = SystemCoreClock; // 1 second timeout

    RTC->INIT = RTC_INIT_KEY;

    if (RTC->INIT != RTC_INIT_ACTIVE_Msk)
    {
        RTC->INIT = RTC_INIT_KEY;

        while (RTC->INIT != RTC_INIT_ACTIVE_Msk)
        {
            if (u32TimeOutCount == 0U)
            {
                return -1;
            }

            u32TimeOutCount--;
        }
    }

    if (psPt == (void *)0)
    {
        /* No RTC date/time data */
    }
    else
    {
        /* Set RTC date and time */
        RTC_SetDateAndTime(psPt);
    }

    return 0;
}

/**
  * @brief      Disable RTC Clock
  *
  *
  *
  * @details    This API will disable RTC peripheral clock and stops RTC counting.
  */
void RTC_Close(void)
{
    CLK->APBCLK0 &= ~CLK_APBCLK0_RTCCKEN_Msk;
}

/**
 *  @brief    Set Frequency Compensation Data
  *
 *  @param[in]    i32FrequencyX10000    Specify the RTC clock X 10000, ex: 327736512 means 32773.6512.
  *
  *
  */
void RTC_32KCalibration(int32_t i32FrequencyX10000)
{

    /*
              Frequency counter measurement : 32773.6512 Hz
    */
    uint32_t u32Compensate;

    /* 327736512 %10000 = 6512  */
    u32Compensate = (uint32_t)((uint32_t)i32FrequencyX10000 % 10000U);
    /*Fraction Part: (6512 X 64)/10000 = 41.6768(0x2A) => RTC_FREQADJ[5:0]=0x2A*/
    u32Compensate = ((u32Compensate * 64U) / 10000U);
    u32Compensate &= 0x3F;
    /*
         Formula for 32K compensation is
           FREQADJ = 0~0x00001F00 (Frequency range : 32752Hz ~ 32783Hz)
    */

    if (i32FrequencyX10000 >= (int32_t)327840000)
    {
        u32Compensate = 0x1F3F;
    }
    else if (i32FrequencyX10000 < (int32_t)327520000)
    {
        u32Compensate = 0x0;
    }
    else
    {
        uint32_t u32Index;

        /*  Integer Part: 32773 => RTC_FREQADJ[12:8] = 0x15 */
        for (u32Index = 0; u32Index < 0x20U ; u32Index++)
        {
            if ((i32FrequencyX10000 >= (int32_t)((int32_t)327520000 + ((int32_t)u32Index * 10000))) && (i32FrequencyX10000 < (int32_t)((int32_t)327520000 + (((int32_t)u32Index + 1) * 10000))))
            {
                u32Compensate += (u32Index << RTC_FREQADJ_INTEGER_Pos);
                break;
            }
        }
    }


    RTC->FREQADJ = (uint32_t)u32Compensate;
}

/**
  * @brief      Get Current RTC Date and Time
  *
  * @param[out] psPt    The returned pointer is specified the current RTC value. It includes: \n
  *                     u32Year: Year value                                                   \n
  *                     u32Month: Month value                                                 \n
  *                     u32Day: Day value                                                     \n
  *                     u32DayOfWeek: Day of week                                             \n
  *                     u32Hour: Hour value                                                   \n
  *                     u32Minute: Minute value                                               \n
  *                     u32Second: Second value                                               \n
  *                     u32TimeScale: [RTC_CLOCK_12 / RTC_CLOCK_24]                           \n
  *                     u8AmPm: [RTC_AM / RTC_PM]                                             \n
  *
  *
  * @details    This API is used to get the current RTC date and time value.
  */
void RTC_GetDateAndTime(S_RTC_TIME_DATA_T *psPt)
{
    uint32_t u32Tmp;

    psPt->u32TimeScale = RTC->CLKFMT & RTC_CLKFMT_24HEN_Msk;     /* 12/24-hour */
    psPt->u32DayOfWeek = RTC->WEEKDAY & RTC_WEEKDAY_WEEKDAY_Msk; /* Day of the week */

    /* Get [Date digit] data */
    g_u32HiYear  = (RTC->CAL & RTC_CAL_TENYEAR_Msk) >> RTC_CAL_TENYEAR_Pos;
    g_u32LoYear  = (RTC->CAL & RTC_CAL_YEAR_Msk) >> RTC_CAL_YEAR_Pos;
    g_u32HiMonth = (RTC->CAL & RTC_CAL_TENMON_Msk) >> RTC_CAL_TENMON_Pos;
    g_u32LoMonth = (RTC->CAL & RTC_CAL_MON_Msk) >> RTC_CAL_MON_Pos;
    g_u32HiDay   = (RTC->CAL & RTC_CAL_TENDAY_Msk) >> RTC_CAL_TENDAY_Pos;
    g_u32LoDay   = (RTC->CAL & RTC_CAL_DAY_Msk) >> RTC_CAL_DAY_Pos;

